//
//  每天一道算法题.c
//  CProject
//
//  Created by 王先生 on 2022/1/19.
//
// 2022.1.18
//********每天一道算法题，猴子吃桃问题：猴子第一天摘下若干个桃子，当即吃了一半，还不过瘾，又多吃了一个。第二天早上又将第一天剩下的桃子吃掉一半，又多吃了一个。以后每天早上都吃前一天剩下的一半零一个。到第十天早上想再吃时，发现只剩下一个桃子了。编写程序求猴子第一天摘了多少桃。
//#include <stdio.h>
//int main(){
//    int day,x1,x2;
//    day = 9;
//    x2 = 1;
//    while(day>0)
//    {
//        x1 = (x2+1)*2;
//        x2 = x1;
//        day--;
//    }
//    printf("猴子第一天摘了%d个桃:\n",x2);
//    return 0;
//}
//
// 2022.1.19
// 中国古代数学家张丘建在他的《算经》中提出了一个著名的“百钱买百鸡的问题”，鸡翁一，值钱五，鸡母一，值钱三，鸡雏三，值钱一，百钱买百鸡，问翁、母、雏各几何？
//翁 <= 20 母 <= 30  雏 <= 300
//#include <stdio.h>
//int main(){
//    int w, m, c;
//    for(w = 0;w <= 20;w++)
//        for(m = 0;m <= 34;m++)
//            for(c = 0; c <= 300; c++)
//                if(c%3==0)
//                    if(w + m + c == 100 && w * 5 + m * 3 + c / 3 * 1 ==100)
//                    printf("翁%d只，母%d只，雏%d只\n价钱为%d\n\n",w,m,c,w * 5 + m * 3 + c /3);
//    return 0;
//}
//刘宇涵
